{"GetCatGuideTopicsResult":[{"HTMLContent":"<h1 class=\"mainContentHeader\">Agency Plan: Checklists<\/h1><p>A major hurricane is every insurance person&rsquo;s nightmare, not  only for the destruction and harm it will inflict, but also for the crushing  workload it will bring in the weeks and months afterward. While no one wants to  dwell on it, the harsh reality is that insurance-relate chaos ensues after a  hurricane or natural disaster. An agency&rsquo;s only hope of properly serving its  clients is to develop a sound, workable, written agency plan. Needless to say,  a plan that is not in writing is not a plan at all! It is the hope of the FAIA  Catastrophe Committee, which developed the following guidelines, that each  agency will invest the time, thought and effort necessary to prepare a plan.<\/p><h2 class=\"subContentHeader\">Plant\/office assessment checklist<\/h2><ul><li>Assess the physical characteristics of the  agency building or office.<\/li><li>Identify areas most vulnerable, and least  vulnerable, to damage from a hurricane (wind, rain, rising water).<\/li><li>Determine steps to minimize damage, such as:  pre-cut plywood sections for windows, sandbags around doorways, moving  equipment to interior portions of the office, etc.<\/li><li>Identify which items of equipment, furniture,  records, and supplies could be moved to safer portions of the office, or to  off-premises locations.<\/li><li>Consider the need to elevate certain items off the  floor if rising water is a serious threat. Procure the equipment needed, such  as blocks of wood or concrete blocks. Smaller items can be stored on desks, or  in rest rooms (which are usually interior, windowless rooms).<\/li><li>Be prepared to secure all files, manuals, and  records. Tape cabinets and drawers shut.<\/li><li>Cover all equipment, furniture, file cabinets,  and storage containers for records with plastic (such as visquine or garbage  bags), and tape tightly.<\/li><li>Before hurricane season, identify promising  sites, and make contact with the owner or leasing agent, so that final  arrangements can be made in short order after a storm if the need arises.<\/li><li>Before leaving, unplug all electrical items.<\/li><\/ul><p><em>(add other items that  may be specific to your workplace)<\/em><\/p><h2 class=\"subContentHeader\">Agency Office Checklists<\/h2><h3 class=\"childContentHeader\">Emergency supplies and  equipment<\/h3>First aid kit<br>Flashlights<br>Batteries and bulbs<br>Crank or battery-operated radio<br>Heavy duty tape<br>Plastic\/visquine<br>City maps (for adjusters)<br>Coleman-type lanterns\/stove\/supplies<br>Candles<br>Matches\/lighters<br>Cans of &ldquo;Fix-a-flat&rdquo;<br>Toilet paper\/other personal hygiene supplies<br>Non-perishable food (canned, dried, etc.)<br>Bottled water, instant coffee, sweetener, non-dairy creamer,  tea<br>Soft drinks\/juice<br>Pain reliever (aspirin\/acetaminophen, etc.)<br>Adequate supply of medication (for each staff person)<br>Manual can opener<br>Eating utensils<br>Trash bags<br>Paper plates, bowls, and cups<br>Paper towels and\/or napkins<br>Diapers\/related supplies<\/p><h3 class=\"childContentHeader\">Office Supplies<\/h3>Staples<br>Tape<br>Pens<br>Carbon paper or NCR claim forms<br>Stamps<br>File folders<\/p><h3 class=\"childContentHeader\">Claims supplies<\/h3>ACORD Notice of Loss forms<br>Agent Memo of Loss <br>Sample Coverage Forms (for adjusters)<br>Notice of Loss acknowledgement cards <\/p>","ID":3,"LastUpdateString":"10\/29\/2012","LastUpdated":"\/Date(1351483200000-0400)\/","Name":"Agency Plan: Checklists"},{"HTMLContent":"<h1 class=\"mainContentHeader\">Claims information for non-claims  staff<\/h1><p>Orient the non-claims staff to the most frequently asked  questions following a catastrophe. The following list of topics should be  reviewed with the people who don&rsquo;t normally handle claims. Each agency should  expand or change items on the list as the situation warrants.<\/p><ul><li><strong>Temporary Repairs: <\/strong>If the damage is  considered a covered loss (be careful of flood\/rising water exclusion), nearly  all policies pay for temporary repairs to protect insured property from further  damage. Keep all receipts. <\/li><li><strong>Debris Removal: <\/strong>Removal of debris  following a covered loss (be careful of flood\/rising water exclusion) is  covered, with certain dollar limits tied to the amount of insurance.<\/li><li>Trees, at least, will be moved from the house  into the yard, or may even be removed from the premises completely, under  certain homeowners policies and under certain conditions. (For example: ISO  policies cover removal of trees if they are downed by a covered peril and damage  a covered structure; trees merely blown down in the yard are not generally  covered as property, or eligible for debris removal.)<\/li><li><strong>Additional Living Expenses: <\/strong>Reasonable  expenses are covered if the residence is made uninhabitable by direct damage  from a covered peril. In the event of an evacuation ordered by a civil  authority following damage in the area, additional living expenses are covered  for up to two weeks. Keep receipts.<\/li><\/ul><h1 class=\"mainContentHeader\">Temporary workers and job descriptions<\/h1><p>Develop and maintain a list of  people available for temporary work<\/a>. Contact people on the list prior to a  hurricane and arrange for their transportation to your office. Part-time  employment agencies are sometimes consulted for temporary help; however, former  employees who are willing to work a week or two in an emergency situation are  excellent for this job, as are relatives of current employees. The list should  include each person&rsquo;s name, address, telephone number and current place of  employment. <br>Consider preparing job descriptions for volunteers before  the catastrophe to cut down on the chaos. <\/p><h2 class=\"subContentHeader\">Sample volunteer job assignments<\/h2><h3 class=\"childContentHeader\">Communications\/volunteer  coordinator<\/h3>Helps customers who have a problem with their claim, need  to drop off information for their adjuster, or need to set up an appointment  with a company representative or adjuster. Directs the work of other temporary  or volunteer employees. Helps resolve problems and conflicts.<\/p><h3Personal\/Commercial CSR  assistant<\/h3><ul><li>Check files: Each CSR has a box with files that  were pulled for use in the claims department. <\/li><li>Look at file, verify it is in the right office  by checking it against the customer list on CSRs door, then file it in cabinet.<\/li><li>Assist CSR with suspense items, mail,  attachments, certificates, etc...<\/li><li>Reconstruct files if needed.<\/li><li>Take first reports.<\/li><li>Supervise donations by directing traffic to the  storage room and organizing supplies.      <\/li><li>Relieve CSRs so they can attend to personal  matters at home.   <\/li><li>Assist company representatives in issuing  drafts.<\/li><\/ul><h3 class=\"childContentHeader\">Front desk\/receptionist<\/h3><ul><li>Greet customers as they arrive and place them on  the appropriate waiting list.  <\/li><li>Maintain a positive, cheerful attitude and help  create a sense of calm by acting professional at all times.<\/li><li>Prepare waiting lists as follows:<\/li><li>First  reports: for customers who need to report their claim for the first time.<\/li><li>Agency  drafts: for customers who have already made their first report and need to see  an agency claims representative for emergency money. Our company has authority  to issue drafts for the following companies: (list companies)<\/li><li>Company  drafts or problems: This waiting list will be based on which companies are  physically here in the building and writing advance checks. This will be  determined at the time, and not all companies will be here at the same time. If  the company is here writing drafts, do not place insured on the waiting list  for company drafts; put the insured on the appropriate company waiting list.<\/li><\/ul><h3 class=\"childContentHeader\"> Runner\/general<\/h3><ul><li>Retrieve and return customer files.<\/li><li>Copy declaration pages.<\/li><li>Deliver messages.<\/li><\/ul><h3 class=\"childContentHeader\">Front desk runner<\/h3><ul><li>Assist front desk personnel in directing  customers where to go for appropriate services.<\/li><li>Take customers to the claims-taking area and  turn them over to the claims representative.<\/li><li>Direct customers to appropriate company offices.<\/li><li>Always return to the front desk and await  instructions.<\/li><\/ul><h3 class=\"childContentHeader\">Claims first report runner<\/h3><ul><li>Get the customer file from the appropriate CSR&rsquo;s  office, copy the declaration page(s) of the policy, and give the file to the  representative taking the claim.<\/li><li>Once the claims representative is done with the file,  take the file back to the office from which you took it. Check the customer  list on the CSR&rsquo;s door to make sure you have the right office, and then place  the file in the Return Box for the CSR to file back.<\/li><li>Return to the claims-taking area for your next  assignment.<\/li><\/ul><h3 class=\"childContentHeader\">Claims checks runner<\/h3><ul><li>Responsible for going to the front desk to get  the first customer on the list. Cross that customer off the list and take them  to the claims representative.<\/li><li>Retrieve insureds files, in which case you will  go to the appropriate CSR&rsquo;s office and get the file from the &ldquo;Return Box&rdquo; or  from the filing cabinet and bring it to the claims representative issuing the  draft.<\/li><li>Take files back to the appropriate CSR&rsquo;s office  and place in the Return Box. <\/li><li>Return to the front desk and get the next person  on the waiting list.<\/li><\/ul><h3 class=\"childContentHeader\">Company runner<\/h3><ul><li>Assist company representatives.<\/li><li>Look on the appropriate company log at the front  desk, then take the first person on the list and cross the name off. Take that  customer to the appropriate company representative.<\/li><li>Pull the customer files. Go to the appropriate  CSR&rsquo;s office, pull the file from the cabinet or Return Box and take it to the  company representative.<\/li><li>Return the file to the appropriate CSR&rsquo;s office,  checking the customer list on the door to make sure you are returning to the  right office. Place file in Return Box.<\/li><li>Return to company representative for further  instructions.<\/li><\/ul><h3 class=\"childContentHeader\">Communications runner<\/h3>Help expedite communications taking cues from  communications center coordinator.<\/p>","ID":8,"LastUpdateString":"10\/29\/2012","LastUpdated":"\/Date(1351483200000-0400)\/","Name":"Agency Plan: Personnel"},{"HTMLContent":"<h1 class=\"mainContentHeader\">Agency Plan: Power and Technology<\/h1><h3 class=\"childContentHeader\">Power<\/h3><ul><li>Identify all equipment that operates on  electricity, and find an alternative or back-up, such as:<\/li><li>Manual typewriters <\/li><li>Carbon paper<\/li><li>Stamps<\/li><li>Battery or solar calculator<\/li><li>Batteries<\/li><\/ul><h3 class=\"childContentHeader\">Considerations for purchasing a generator<\/h3><ul><li>Size needed (kilowatt-hour power)<\/li><li>Type: plug-in vs. hard wired<\/li><li>Fuel type (gas, diesel, natural gas)<\/li><li>Rate of fuel usage<\/li><li>Fuel storage\/availability<\/li><li>Maintenance supplies for <\/li><li>Extended use (engine oil, etc...)<\/li><li>Security for the generator at night   <\/li><li>Back feed (generated electricity goes back into  the feeder lines, endangering line crews)     <\/li><\/ul><h3 class=\"childContentHeader\">Computers<\/h3><ul><li>Even when the power starts being restored,  service is often interrupted or fluctuates. In such situations, one either  operates without a computer, or ties the computer to the generator.<\/li><li>Most computer experts warn against running a  computer off self-generated electricity, as the current flow is usually too  uneven, and contains &ldquo;spikes&rdquo; that can harm the equipment. The potential for  damage is often lessened when using larger generators, but check with your  computer vendor. One solution to stabilizing and modulating the electrical  current is to use a UPS (uninterrupted power supply) system.<\/li><li>Be sure to completely back up the system, then  verify the backup worked. Keep duplicates in a safe area off premises.<\/li><li>Consider running ACORD Loss Notices for clients  in areas certain to experience damage, such as beach front locations. In larger  agencies, this could amount to a considerable quantity of forms, and safe, dry  storage could create a problem.<\/li><li>Most automation vendors have specific, detailed  catastrophe plans for assisting their customers.  Contact yours, so you can know what to  expect.<\/li><\/ul><h3 class=\"childContentHeader\">Phones<\/h3><ul><li>Most telephone systems found in agencies today  use electronic phones, which of course won&rsquo;t work without electricity. However,  the phone lines themselves are often still working after a hurricane. <\/li><li>If the electricity is off, but the phone lines  are working, phone service can be restored by using &ldquo;old-fashioned&rdquo; manual  telephones. Consult your local phone vendor. Usually, separate lines have to be  run to hook the manual phones. These lines can be stored, pre-wired, in the  ceiling, and dropped down when needed.                <\/li><li>Some agencies plan on using cellular phones  during emergency operations. Remember to have plenty of batteries, and battery  chargers. Remember also to announce these new numbers in the newspaper. Another  possibility might be to &quot;Call Forward&quot; the agency&rsquo;s number to a  cellular phone.<\/li><li>Find out if your cell-phone service provider has  a Priority Access Program for catastrophe operations. Under this program, only  those cellular customers with a Priority Access number will be able to use cell  service after a catastrophe, as a large portion of the cellular service will be  appropriated for emergency personnel. <\/li><li>Consider using voice mail to handle the large  volume of after-hours calls.<\/li><\/ul>","ID":9,"LastUpdateString":"10\/29\/2012","LastUpdated":"\/Date(1351483200000-0400)\/","Name":"Agency Plan: Power and Technology"},{"HTMLContent":"<h1 class=\"mainContentHeader\">Agency Plan: Working with the Media<\/h1><p>After the media finish describing the destruction wrought by  a catastrophe and its impact on the residents and the businesses in the area,  they will ask, &ldquo;What will be done to restore things as they were?&rdquo;<br>That&rsquo;s when reporters begin searching for insurance sources.  The reporters involved may never have produced an insurance story before, and,  therefore have no established contacts.<br>These reporters face obstacles trying to write a good  catastrophe story under deadline pressure. They have to find a qualified,  competent and articulate source, they may not know what questions to ask, and  they must ensure the source is credible.<\/p><h2 class=\"subContentHeader\">Industry response<\/h2><p>Several groups act as statewide insurance information  sources for the Florida media.<br><ol><li><a href=\"http:\/\/www.faia.com\">FAIA<\/a><li><a href=\"http:\/\/www.flains.org\" target=\"_blank\">The Florida Insurance Council <\/a><\/li><li><a href=\"www.iii.org\" target=\"_blank\">The Insurance Information Institute<\/a><\/li><\/ol>These groups are in contact with one another prior to a  hurricane strike or following any catastrophe. They share information and  coordinate their activities.<br>Fundamentally, it is their task to work with the media so  agents can attend to the needs of their clients. The media already will have  received news releases explaining catastrophe coverages and procedures. When a  hurricane is on its way, they will get additional material. And when the storm  has done its damage, these groups will coordinate with the media.<br>The main reason for this type of centralized response is  uniformity. It frustrates and impedes the media to have varying numbers or  conflicting advice floating around. It&rsquo;s also poor industry public relations to  swamp the media with uncoordinated calls from the industry.<br><br>Nevertheless, agents will be called. Industry news releases  may not have gotten to the reporter assigned the story, and local media want  local sources, and properly so. A local agent can provide important  perspectives on what&rsquo;s happening.<br>Reporters may ask:<\/p><ul><li>Where are emergency claim centers?<\/li><li>Who should be called?<\/li><li>How must property be protected from further  damage?<\/li><li>What records will be needed?<\/li><\/ul><p>Even if the reporter doesn&rsquo;t ask for the information, make  sure you communicate the importance of remaining calm and patience. Assure the  reporter that insureds claims will be handled fairly and as quickly as  possible. Information such as websites for claim information and telephone  numbers should be included in all media releases.<br>There are no hard and fast rules for talking with reporters.  The reporter and situation will vary enough to create multiple exceptions to  nearly all rules. Here are a few tips, however:<\/p><ul><li>Be honest and direct. Reporters are genuinely  appreciative of those who help them prepare a good story.<\/li><li>If you won&rsquo;t know the answer to a question, say  so. Don&rsquo;t try to fudge if you are not 100 percent certain.  <\/li><li>Agents should not try to sell a reporter on  their points of view. Help the reporter get his\/her story. <\/li><li>Remember and respect the reporter&rsquo;s deadline.<\/li><li>Some reporters will be new to insurance coverage  and may not know what questions to ask, or ask the right questions. That&rsquo;s a  wonderful time to be helpful. Try to learn what the reporter&rsquo;s assignment is  and explain the insurance angles that might fit.<\/li><li>Treat each reporter as an individual. Bad  experiences with other journalists don&rsquo;t count. Media relations are &ldquo;win some,  lose some&rdquo; propositions. Keep plugging.<\/li><\/ul>","ID":6,"LastUpdateString":"10\/29\/2012","LastUpdated":"\/Date(1351483200000-0400)\/","Name":"Agency Plan: Working w\/the Media"},{"HTMLContent":"<h1 class=\"mainContentHeader\">Before Leaving the Office...<\/h1><p>Questions to ask before leaving the office before a  hurricane (answers should all be &ldquo;yes&rdquo;).<\/p><ul><li>Are all permissible binders typed and mailed to  the company?<\/li><li>Are all permissible policies typed and mailed to  the company?<\/li><li>Do you have a list of files you were working on  to pull after the hurricane reporting is done?<\/li><li>Are all desks, tables, etc.., cleared?<\/li><li>Are all kitchen supplies adequate?<\/li><li>Have arrangements been made for personnel to get  to the office?<\/li><li>Are all personnel aware of alternate routes to  the office if the main arteries are blocked?<\/li><li>Is the receptionist informed as to the routing  of calls upon returning to the office?<\/li><li>Are all necessary claims forms in order and  easily accessible?<\/li><li>Has every measure been taken to protect the  agency against damage?<\/li><li>Are all personnel informed as to their duties  when they return?<\/li><\/ul>","ID":2,"LastUpdateString":"10\/29\/2012","LastUpdated":"\/Date(1351483200000-0400)\/","Name":"Before Leaving the Office"},{"HTMLContent":"<h1 class=\"subContentHeader\">Claims<\/h1><p>First things first: Get company claim numbers to insureds  (ideally, this should have been done before the storm!).<\/p><p>Since Hurricane Andrew, the responsibility for reporting  claims has shifted from the agency to the company. This does not mean that all  claims will be processed directly to the company. The agency will still have  many insureds who will contact them directly and expect to report the loss as  they have in the past. Still, with power outages and the loss of phone lines,  it may be more practical to have the insured contact the company directly.<\/p><p>Post company claim and fax numbers on your agency&rsquo;s  website, and remind your insureds that claim service is available 24-hours a  day. <\/p><p>Many insureds will visit your office, particularly if  local phone service is down. This can and will cause a great deal of disruption  to the office. If the agency can convey the message that all claims will be  handled on a priority basis with the most serious claim handled first, it will  ease tensions. This message should also be distributed to the local media with  a request for the public to remain calm and patient. <\/p><h2 class=\"subContentHeader\">Loss Reporting<\/h2><p>If your carrier requires you to do loss reporting, be  certain each Notice of Loss form is properly completed. Check each loss notice  for completeness and accuracy before mailing them. One individual should be  given the responsibility for checking each form and the authority to follow up  with others to see that it is properly completed.<br><br>In completing the ACORD form, attention to detail is important.  Show all coverages and form numbers. Be sure to include edition dates and all  endorsement numbers. Many companies are using unrevised forms, and independent  adjusters won&rsquo;t necessarily know which companies are using which forms.<br><br>If it is necessary to request emergency handling by the  adjuster, make sure there is an accurate explanation of why such action is  necessary. For example, if an agent has a sincere and true hardship case, the  ACORD form should be noted &ldquo;hardship case,&rdquo; with an explanation attached. Use  discretion and only request emergency handling when necessary.<br>Prior to mailing, the person checking the loss forms  should confirm each of the following:<\/p><ul><li>All copies are legible<\/li><li>If not typed, print forms are completed in ball  point pen<\/li><li>The policy number is complete, including prefix,  symbols, suffix, etc.<\/li><li>The name appears on the loss notice as it does  on the policy<\/li><li>The description section provides as much detail  as possible <\/li><li>If the loss involves some special company  policy, a copy of the contract and copies of all pertinent forms is attached.<\/li><\/ul><p>A separate file for catastrophe claims could prove to be  of great value in following up on loss reports and in tabulating loss  experience. Retain three copies of the ACORD Notice of Loss form for the agency.<br><br>Original-To carrier<br>Copy No. 1-Catastrophe loss file<br>Copy No. 2-Insured&rsquo;s file<br>Copy No. 3-Suspense for follow-up at a later date<br>An agency may find it necessary to substantiate those  claims related to the catastrophe for company loss and contingency purposes.  Agency agreements vary by carrier, but many will include a stop loss for single  occurrences in determining agency profitability.<br><br>Even in the absence of such an arrangement, the agency  should document those claims resulting from a catastrophe for future company  negotiations and relations. <br>Maintain a separate claims log for each carrier.<\/p><h2 class=\"subContentHeader\">First Report of Loss<\/h2><p>Upon first contact with the insured, take the time to  explain any deductible clauses and ask the insured to arrange for any repairs  necessary to protect the property. Point out that the reasonable cost of such  repairs may be included in her claim. Insureds should be cautioned about hiring  unlicensed or uninsured contractors and advised to check with the Better  Business Bureau before accepting services from unknown contractors or repair  shops.<br><br>Explain to each claimant how losses will be adjusted and  that there may be delays. If each client who reports a claim understands there  are thousands of losses involved and the most seriously damaged property should  and will have priority treatment, he or she will be less likely to be angry or  complain if a delay occurs. <br><br>If a mortgage or loss payable clause applies, the loss draft  will also include the name of the appropriate party. FHA regulations require  inspection of the property before repairs are made in excess of $1,000. In some  instances (extreme damage), this may be required under any type of mortgage. In  almost all cases, the mortgagee will require inspection of repairs before  endorsement of the draft. To avoid confusion and misunderstandings, advise your  insureds of this and tell them to contact the mortgagee if they have questions.<br><br>If damage to personal property is involved, each insured  should be advised to request a separate draft for payment so proceeds won&rsquo;t be  held up by a mortgage requirement on building damage.<br><br>Providing as much information as possible to the insured  about reporting a loss and explaining the claim process, in the long run, will  save time. <br><br>One method used to expedite the catastrophe claims process  is the &ldquo;Agent&rsquo;s Memo of Loss&rdquo; form. Use of a standard memo of loss is important  during the heavy workload and confusion following a catastrophe. The memo of  loss may be used according to individual agency needs, and can be used to take  claims over the phone. One or two individuals should be available to type or  complete the ACORD forms using the loss memo and the insureds file.<\/p><h2 class=\"subContentHeader\">Mail a follow-up letter to the insured with each loss report<\/h2><p>Often, in the wake of a hurricane, losses are overwhelming.  The insured, though he has reported the loss to the agent and received  courteous treatment, is still not certain that his particular claim has not  become lost in the shuffle. A follow-up letter from the agency reassures the  customer and provides a written review of the procedures outlined in the  telephone conversation.<br><br>Below is some language for a suggested letter for agents to  send to an insured after receipt of a catastrophe loss report. It should be  prepared on the agent&rsquo;s letterhead.<br><br>Dear (customer):<br><br>The report of damage to your property caused by the  hurricane is acknowledged. We have forwarded the necessary written report to  (name of adjusting organization, address and phone number) and a representative  will contact you as soon as possible.<br><br>You should arrange for temporary repairs needed to protect  your property from further damage. The bill for any such necessary repairs  should be held by you pending arrival of the adjuster and the cost will be  included in your claim. Contractors&rsquo; estimates for permanent repairs may not be  necessary unless there is extensive damage, since the adjuster can make  estimates using prevailing cost figures of local contractors and repair shops.  It is, of course, your privilege to obtain detailed estimates from a contractor  of your choice before settling the loss. We feel, however, that the adjuster is  capable of arriving at a fair settlement and also think this procedure will  expedite loss settlements. If you do secure estimates, please hold them for the  adjuster.<br><br>In a catastrophe such as this, the facilities of all  insurance companies are taxed to an unusual degree because of the thousands of  losses that have suddenly occurred. The companies this agency represents have  augmented their local facilities by bringing in adjusters from other parts of  the country to expedite loss adjustment work. Your loss will receive attention  as soon as possible.<br><br>Your understanding and cooperation in this trying situation  is greatly appreciated. Do not hesitate to get in touch with us about any  questions concerning your loss.<br>Sincerely,<br>(agent signature)<\/p>","ID":5,"LastUpdateString":"10\/29\/2012","LastUpdated":"\/Date(1351483200000-0400)\/","Name":"Claims Handling"},{"HTMLContent":"<h1 class=\"mainContentHeader\">Guide for Zone Coordinators<\/h1><p>The following plan of action will come into play when a  tropical storm or hurricane is within three days of landfall in Florida.<\/p><h2 class=\"subContentHeader\">Three Days Before the Storm <\/h2><p>FAIA staff will initiate contact with zone coordinators and  provide them with the latest storm forecast. The zone coordinators will then  contact county liaisons in their zone to be sure they are aware of the  impending storm. <br><br>If an agency has not yet acquired disaster supplies, immediate  action should be taken, to obtain:<\/p><ul><li>power generators <\/li><li>gas <\/li><li>cash <\/li><li>bottled water <\/li><li>ice <\/li><li>nonperishable food <\/li><li>paper copies of loss claims forms <\/li><\/ul><p>Zone coordinators should make sure they have their SERT badges  (which are needed for access into stricken areas immediately after a disaster)  and the record-keeping charts for the badges. We are required to keep a written  record of each badge number and the agent to whom it was assigned after a  disaster.  Zone coordinators should also  be prepared to answer questions from media regarding how homeowners can prepare  for a storm to mitigate property damage.<\/p><h2 class=\"subContentHeader\">Two Days Before the Storm <\/h2><p>Zone coordinators will contact volunteers who may be needed to  help other agencies when a disaster strikes. Zone coordinators should help make  travel and lodging arrangements for volunteers. All zone coordinators in areas threatened by an impending storm should remain in contact with FAIA's  FAIA's  Catastrophe Task Force liaison Daniel Francis (<a href='mailto:dfrancis@faia.com'>dfrancis@faia.com<\/a>), who will be attending briefings and answering calls at the State Emergency Operations Center (EOC). Zone coordinators should reestablish contact touch base with their local county emergency management directors to review how the insurance teams can assist duringhelp during and after the impending disaster. <\/p><h2 class=\"subContentHeader\">One Day Before the Storm <\/h2><p>FAIA will send brief news releases to media in areas of anticipated storm impact, providing them with the names, phone numbers and other contact information for the zone coordinators. Zone coordinators should remain in contact with FAIA. Also, they should continue to be prepared to answer questions from the media in respects to mitigating losses.<\/p>","ID":1,"LastUpdateString":"10\/29\/2012","LastUpdated":"\/Date(1351483200000-0400)\/","Name":"Zone Coordinator Guidelines"}]}